In [1]:
import pandas as pd

In [13]:
path = 'C:/Users/ameli/IRONHACK/WEEK_5/MBP/data/clean/'
file_name_1 = 'num_turists_by_origin.xlsx'
file_name_2 = 'turism_expenditure_by_ccaa_origin.xlsx'

num = pd.read_excel(path+file_name_1)
num = num.drop('Unnamed: 0', axis = 1)
exp = pd.read_excel(path+file_name_2)
exp = exp.drop('Unnamed: 0', axis = 1)

In [14]:
num.head()

  origin    value       date
0  Total  7460277 2022-06-01
1  Total  6966913 2022-05-01
2  Total  6102142 2022-04-01
3  Total  4032127 2022-03-01
4  Total  3156809 2022-02-01

In [20]:
num.value_counts()
num.shape

(1293, 3)

In [19]:
exp.shape

(1152, 5)

In [17]:
exp.value_counts()

origin       category                      destiny         value     date
Alemania     Duración media de los viajes  Andalucía       8.96      2019-01-01    1
                                                           10.18     2018-01-01    1
Reino Unido  Duración media de los viajes  Andalucía       9.70      2016-01-01    1
                                                           9.40      2017-01-01    1
                                                           9.10      2020-01-01    1
                                                                                  ..
Francia      Gasto total                   Total Nacional  7593.45   2019-01-01    1
                                                           7405.54   2018-01-01    1
                                                           7052.36   2017-01-01    1
                                                           6776.23   2016-01-01    1
Total        Gasto total                   Total Nacional  91911.97  2019-01-01    1
Length: 1152, dtype: int64